Revit 2026 API

# MEPNetworkSegmentData Class

---

Represents the analysis data for one network segment.

SystemObject Autodesk.Revit.DB.AnalysisMEPNetworkSegmentData

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPNetworkSegmentData : IDisposable
```
```vb
Public Class MEPNetworkSegmentData
	Implements IDisposable
```
```cpp
public ref class MEPNetworkSegmentData : IDisposable
```
```fsharp
type MEPNetworkSegmentData =
    class
        interface IDisposable
    end
```

The MEPNetworkSegmentData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MEPNetworkSegmentData | Creates a default segment data object. |
|  | MEPNetworkSegmentData(MEPNetworkSegmentData) | Creates a new segment data object based on another object. |

|  | Name | Description |
| --- | --- | --- |
|  | Coefficient | The calculated coefficient of this segment, dimensionless. |
|  | Flow | The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction. |
|  | FlowState | The calculated flow state of this segment. |
|  | FrictionFactor | The calculated friction factor of this segment, dimensionless. |
|  | IsCriticalPath | Verifies if the segment is on the critical path. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PressureDrop | The calculated pressure drop of this segment, in kg/(ft*s^2). |
|  | RelativeRoughness | The relative roughness of this segment, dimensionless. |
|  | ReynoldsNumber | The Reynolds number of this segment, dimensionless. |
|  | SectionNumber | The section this segment belongs to. |
|  | Velocity | The calculated velocity of this segment, in ft/s. |
|  | VelocityPressure | The calculated velocity pressure of this segment, in kg/(ft*s^2). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MEPNetworkSegmentData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDownstreamSegments | Gets all downstream network segments. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUpstreamSegments | Gets all upstream network segments. |
|  | IsValid | Verified if this segment data has been assigned some valid values afer calculation. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace